{
    "title": "Understanding Trump's Tariff Equation",
    "date": "9 April 2025",
    "time": "3:45 PM",
    "timezone": "EST",
    "description": "A finance student's analysis of the Trump administration's tariff formula: how it works, how it's meant to work, and its critical flaws.",
    "genres": ["Economics", "Finance", "Politics"],
    "images": [
      {
        "url": "/images/article_4_9_2025_1.jpg",
        "description": "Cover image showing tariff equation",
        "credit": "Original illustration"
      },
      {
        "url": "/images/article_4_9_2025_2.jpg",
        "description": "Tariff equation with annotations",
        "credit": "USTR.gov with author annotations"
      },
      {
        "url": "/images/article_4_9_2025_3.jpg",
        "description": "Simplified tariff formula",
        "credit": "Author's simplification"
      },
      {
        "url": "/images/article_4_9_2025_4.jpg",
        "description": "Vietnam tariff calculation example",
        "credit": "Based on White House data [https://ustr.gov/countries-regions/southeast-asia-pacific/vietnam]"
      }
    ],
    "body": [
      "<p>Understanding Trump's Tariff Equation</p>",
      "<p>As a college sophomore, who has taken not much further than basic economics, finance, and calculus coursework, I was surprised at how accessible the Trump administration's tariff formula was. As per my responsibility as a finance student, I will explain exactly how this formula works, how the Trump administration wants it to work, and the problems I observed with it.</p>",
      "<p>The exact formula, sourced from <a href='https://ustr.gov/issue-areas/reciprocal-tariff-calculations' target='_blank'>https://ustr.gov/issue-areas/reciprocal-tariff-calculations</a>, with my annotations, is as follows:</p>",
      "<img src='/images/article_4_9_2025_2.jpg' alt='Tariff equation with annotations' style='max-width:100%; height:auto;'>",
      "<p>Everything is relatively straightforward except for the denominator, specifically \"ε\" and \"φ\". These values are set simply to -4 and 0.25, respectively, as per the government website, so multiplied they yield to -1. However, they are still important to understand. ε, put simply, represents the rate at which the amount we buy of any product changes when its price changes. So, at ε=-4, any 1% increase in price means 4% less purchases. φ represents \"passthrough\", the actual change in price the consumer pays with tariffs. Even if tariffs are 100% on a $100 product, consumers would only pay $125 because φ = 0.25. There is a problem with this passthrough percentage which will be touched on later in the article. Overall, this is the simplified version of the formula:</p>",
      "<img src='/images/article_4_9_2025_3.jpg' alt='Simplified tariff formula' style='max-width:100%; height:auto;'>",
      "<p>When trading with other countries, the USA often buys more than they sell to them. This means that the USA is giving more money than they are getting. This is how other countries are \"ripping us off\" as per Trump's view. A country that exemplifies this is Vietnam, who exports much more than they import with the USA. This formula in action with Vietnam as an example country, and data sourced from the White House, is as follows:</p>",
      "<img src='/images/article_4_9_2025_4.jpg' alt='Vietnam tariff calculation example' style='max-width:100%; height:auto;'>",
      "<p>This aligns with the 90% seen in the cover image. However, this 90.4%, as well as all the other tariff rates, were cut in half because Trump noted that charging the full reciprocal amount \"would have been tough for a lot of countries\" during his April 2nd announcement, thus charging Vietnam 46% instead. Furthermore, any tariff rate that is below 10% is set at 10% by default.</p>",
      "<p>Does it actually work? In theory, yes, but in practice, absolutely not. This is the kind of equation that works \"ceteris paribus\", meaning that nothing else changes. If nothing else were to change, meaning that Vietnam didn't retaliate in any way when hit with the 90.4% tariff, the price to import would be so expensive that USA consumers and businesses would only want to import exactly $13.1 billion, which is what we export to Vietnam. This works using the numbers provided by the government.</p>",
      "<p>However, the myriad of real-world events that would follow a near 50%, let alone a near 100% tariff to Vietnam and other countries would obfuscate the Trump administration's predictions for the future. Events like:</p>",
      "<p><strong>Vietnam retaliates with its own tariffs:</strong> A Vietnamese retaliatory tariff strategy would likely target politically sensitive US exports such as agricultural products (especially soybeans and corn), technology, and manufacturing equipment, potentially causing substantial harm to US farmers and manufacturers dependent on Vietnamese markets while simultaneously inflating input costs for Vietnamese industries reliant on US components.</p>",
      "<p><strong>Vietnamese producers lower prices to absorb tariffs:</strong> Vietnamese manufacturers, particularly in labor-intensive industries like textiles and furniture where profit margins are already thin (typically 3-7%), would face existential pressure to compress their margins further, potentially leading to quality reductions, worker exploitation, or bankruptcy for smaller producers unable to sustain prolonged price reductions without government subsidies.</p>",
      "<p><strong>US consumers seek alternative suppliers rather than pay the tariff:</strong> American businesses and consumers would likely redirect their sourcing from Vietnam to other low-cost manufacturing hubs like Cambodia, Bangladesh or Indonesia, incurring substantial transition costs including finding reliable suppliers, establishing quality control systems, negotiating new contracts, and potentially accepting lower quality or higher prices during the adjustment period.</p>",
      "<p><strong>Supply chains reorganize, routing Vietnamese goods through third countries:</strong> Sophisticated businesses might engage in tariff circumvention through transshipment operations—where Vietnamese products undergo minimal processing in third countries like Malaysia or Thailand before being re-exported to the US—necessitating complex customs enforcement mechanisms while potentially undermining the tariff's effectiveness and creating diplomatic friction with countries perceived as enablers of circumvention.</p>",
      "<p>Reflect a small part of the potential things that could dramatically affect the overall outcome.</p>",
      "<p>Finally, there is a critical nuance in the formula that may reduce its accuracy, and it has to do with the passthrough ratio mentioned before. Drawing basic economic information from my college classes, I found it curious that passthrough was drawn at the consumer level instead of the border. After reviewing the reference cited in the White House explanation (<a href='https://www.aeaweb.org/articles?id=10.1257/aeri.20190536' target='_blank'>https://www.aeaweb.org/articles?id=10.1257/aeri.20190536</a>), I found that the 0.25 value could be interchanged, for an arguably more accurate output, with the passthrough at the border set at around 0.95.</p>",
      "<p>Passthrough is observed both on the shores of the USA and in USA stores, and the values are very different. The research clearly shows that while tariffs are almost fully passed through to import prices at the border (95%), retailers absorb roughly three-quarters of these increased costs rather than passing them to consumers. Using the retail passthrough rate (25%) in the formula produces tariff recommendations approximately four times higher than if using the border passthrough rate. This fundamental calibration issue creates a critical flaw in the formula's design: by using retail passthrough instead of border passthrough, the administration's equation systematically overestimates the tariff levels needed to balance trade. The result is likely to be excessively punitive tariffs that could trigger more severe retaliatory measures, harm American consumers through eventual price increases, and potentially damage international trade relationships far beyond what's necessary to achieve the stated policy objectives of reducing trade deficits.</p>",
      "<p>This analysis reveals that while Trump's tariff formula appears straightforward on the surface, it contains several critical flaws that undermine its effectiveness as a trade balancing mechanism. The administration's approach seems elegant and concise in theory—applying targeted tariffs proportional to trade deficits to achieve equilibrium—but fails to account for the complex possibilities of international trade. As demonstrated through the Vietnam example, the formula generates excessively high tariff rates that, even when halved, remain punitive enough to trigger cascading consequences: retaliatory tariffs from trading partners, margin compression for foreign manufacturers, supply chain reorganization through third countries, and domestic market disruptions for American businesses and consumers.</p>",
      "<p>Most significantly, the formula's fundamental calibration error—using retail passthrough rates rather than border rates—systematically overestimates the tariffs needed to achieve trade balance by approximately four times the necessary levels. This miscalibration transforms what might have been a measured policy response into an excessive economic intervention with far-reaching negative consequences. While the goal of reducing trade deficits may be legitimate, this analysis suggests that the administration's mathematical approach is too simplistic and insufficiently calibrated to navigate the complex realities of global trade without causing unintended economic harm to both foreign and domestic stakeholders.</p>"
    ]
  }